app/controllers/tweeets_controller.rb

SELECT "tweeets".* FROM "tweeets" ORDER BY created_at DESC
---
  def index
    @tweeets = Tweeet.all.order("created_at DESC")

INSERT INTO "tweeets" ("tweeet", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["tweeet", "12rtyu"], ["created_at", "2021-02-01 19:59:14.903040"], ["updated_at", "2021-02-01 19:59:14.903040"], ["user_id", 3]]
---
  def create
    @tweeet = current_user.tweeets.build(tweeet_params)

    respond_to do |format|
      if @tweeet.save

DELETE FROM "tweeets" WHERE "tweeets"."id" = ?  [["id", 3]]
---
  def destroy
    @tweeet.destroy